micropython/micropython/ports/wch/bsp/inc/ch32v30x.h
/*******************  Bit definition for WWDG_CTLR register  ********************/
#define  WWDG_CTLR_T                           ((uint8_t)0x7F)               /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CTLR_T0                          ((uint8_t)0x01)               /* Bit 0 */
#define  WWDG_CTLR_T1                          ((uint8_t)0x02)               /* Bit 1 */
#define  WWDG_CTLR_T2                          ((uint8_t)0x04)               /* Bit 2 */
#define  WWDG_CTLR_T3                          ((uint8_t)0x08)               /* Bit 3 */
#define  WWDG_CTLR_T4                          ((uint8_t)0x10)               /* Bit 4 */
#define  WWDG_CTLR_T5                          ((uint8_t)0x20)               /* Bit 5 */
#define  WWDG_CTLR_T6                          ((uint8_t)0x40)               /* Bit 6 */

#define  WWDG_CTLR_WDGA                        ((uint8_t)0x80)               /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define  WWDG_CFGR_W                           ((uint16_t)0x007F)            /* W[6:0] bits (7-bit window value) */
#define  WWDG_CFGR_W0                          ((uint16_t)0x0001)            /* Bit 0 */
#define  WWDG_CFGR_W1                          ((uint16_t)0x0002)            /* Bit 1 */
#define  WWDG_CFGR_W2                          ((uint16_t)0x0004)            /* Bit 2 */
#define  WWDG_CFGR_W3                          ((uint16_t)0x0008)            /* Bit 3 */
#define  WWDG_CFGR_W4                          ((uint16_t)0x0010)            /* Bit 4 */
#define  WWDG_CFGR_W5                          ((uint16_t)0x0020)            /* Bit 5 */
#define  WWDG_CFGR_W6                          ((uint16_t)0x0040)            /* Bit 6 */

#define  WWDG_CFGR_WDGTB                       ((uint16_t)0x0180)            /* WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFGR_WDGTB0                      ((uint16_t)0x0080)            /* Bit 0 */
#define  WWDG_CFGR_WDGTB1                      ((uint16_t)0x0100)            /* Bit 1 */

#define  WWDG_CFGR_EWI                         ((uint16_t)0x0200)            /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define  WWDG_STATR_EWIF                       ((uint8_t)0x01)               /* Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                          ENHANCED FUNNCTION                                */
/******************************************************************************/

/****************************  Enhanced register  *****************************/
#define  EXTEN_USBD_LS                         ((uint32_t)0x00000001)         /* Bit 0 */
#define  EXTEN_USBD_PU_EN                      ((uint32_t)0x00000002)         /* Bit 1 */
#define  EXTEN_ETH_10M_EN                      ((uint32_t)0x00000004)         /* Bit 2 */
#define  EXTEN_ETH_RGMII_SEL                   ((uint32_t)0x00000008)         /* Bit 3 */
#define  EXTEN_PLL_HSI_PRE                     ((uint32_t)0x00000010)         /* Bit 4 */
#define  EXTEN_LOCKUP_EN                       ((uint32_t)0x00000040)         /* Bit 5 */
#define  EXTEN_LOCKUP_RSTF                     ((uint32_t)0x00000080)         /* Bit 7 */

#define  EXTEN_ULLDO_TRIM                      ((uint32_t)0x00000300)         /* ULLDO_TRIM[1:0] bits */
#define  EXTEN_ULLDO_TRIM0                     ((uint32_t)0x00000100)         /* Bit 0 */
#define  EXTEN_ULLDO_TRIM1                     ((uint32_t)0x00000200)         /* Bit 1 */

#define  EXTEN_LDO_TRIM                        ((uint32_t)0x00000C00)         /* LDO_TRIM[1:0] bits */
#define  EXTEN_LDO_TRIM0                       ((uint32_t)0x00000400)         /* Bit 0 */
#define  EXTEN_LDO_TRIM1                       ((uint32_t)0x00000800)         /* Bit 1 */


/******************************************************************************/
/*                                  DVP                                       */
/******************************************************************************/

/*******************  Bit definition for DVP_CR0 register  ********************/
#define RB_DVP_ENABLE			0x01					// RW, DVP enable
#define RB_DVP_V_POLAR			0x02					// RW, DVP VSYNC polarity control: 1 = invert, 0 = not invert
#define	RB_DVP_H_POLAR			0x04					// RW, DVP HSYNC polarity control: 1 = invert, 0 = not invert
#define	RB_DVP_P_POLAR			0x08					// RW, DVP PCLK polarity control: 1 = invert, 0 = not invert
#define RB_DVP_MSK_DAT_MOD		0x30					
#define 	RB_DVP_D8_MOD			0x00				// RW, DVP 8bits data mode
#define		RB_DVP_D10_MOD			0x10				// RW, DVP 10bits data mode
#define		RB_DVP_D12_MOD			0x20				// RW, DVP 12bits data mode
#define	RB_DVP_JPEG				0x40					// RW, DVP JPEG mode

/*******************  Bit definition for DVP_CR1 register  ********************/
#define RB_DVP_DMA_EN			0x01					// RW, DVP dma enable
#define RB_DVP_ALL_CLR			0x02					// RW, DVP all clear, high action
#define	RB_DVP_RCV_CLR			0x04					// RW, DVP receive logic clear, high action
#define RB_DVP_BUF_TOG			0x08					// RW, DVP bug toggle by software, write 1 to toggle, ignored writing 0
#define RB_DVP_CM				0x10					// RW, DVP capture mode
#define	RB_DVP_CROP				0x20					// RW, DVP Crop feature enable
#define RB_DVP_FCRC				0xC0					// RW, DVP frame capture rate control: 
#define		DVP_RATE_100P		0x00					//00 = every frame captured (100%) 
#define		DVP_RATE_50P		0x40					//01 = every alternate frame captured (50%)
#define		DVP_RATE_25P		0x80					//10 = one frame in four frame captured (25%)

/*******************  Bit definition for DVP_IER register  ********************/
#define	RB_DVP_IE_STR_FRM		0x01					// RW, DVP frame start interrupt enable
#define	RB_DVP_IE_ROW_DONE		0x02					// RW, DVP row received done interrupt enable
#define RB_DVP_IE_FRM_DONE		0x04					// RW, DVP frame received done interrupt enable
#define	RB_DVP_IE_FIFO_OV		0x08					// RW, DVP receive fifo overflow interrupt enable	
#define RB_DVP_IE_STP_FRM		0x10					// RW, DVP frame stop interrupt enable				

/*******************  Bit definition for DVP_IFR register  ********************/
#define RB_DVP_IF_STR_FRM	    0x01				    // RW1, interrupt flag for DVP frame start
#define RB_DVP_IF_ROW_DONE		0x02				    // RW1, interrupt flag for DVP row receive done
#define RB_DVP_IF_FRM_DONE		0x04				    // RW1, interrupt flag for DVP frame receive done
#define RB_DVP_IF_FIFO_OV		0x08				    // RW1, interrupt flag for DVP receive fifo overflow
#define RB_DVP_IF_STP_FRM		0x10				    // RW1, interrupt flag for DVP frame stop

/*******************  Bit definition for DVP_STATUS register  ********************/
#define RB_DVP_FIFO_RDY			0x01					// RO, DVP receive fifo ready
#define RB_DVP_FIFO_FULL		0x02					// RO, DVP receive fifo full
#define RB_DVP_FIFO_OV			0x04					// RO, DVP receive fifo overflow
#define RB_DVP_MSK_FIFO_CNT		0x70					// RO, DVP receive fifo count



#include "ch32v30x_conf.h"


#ifdef __cplusplus
}
#endif

#endif 




